<a href="https://colab.research.google.com/github/Minibo/Synthanic/blob/main/Synthtanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

Идея!
Попробавать рандомный лес

Попробовать классификацию

Посмотреть на фичи

In [2]:
!unzip '/content/drive/MyDrive/Data for Colab/Synthtanic/train.csv.zip' train.csv

Archive:  /content/drive/MyDrive/Data for Colab/Synthtanic/train.csv.zip
  inflating: train.csv

In [3]:
train = pd.read_csv('/content/train.csv')

In [15]:
sum(train[train.columns[5]].isna())

3292

In [16]:
sum(train[train.columns[5]].notna())

96708

In [4]:
train.head(20)

    PassengerId  Survived  Pclass  ...    Fare   Cabin  Embarked
0             0         1       1  ...   27.14  C12239         S
1             1         0       3  ...   13.35     NaN         S
2             2         0       3  ...   71.29     NaN         S
3             3         0       3  ...   13.04     NaN         S
4             4         1       3  ...    7.76     NaN         S
5             5         0       2  ...    6.71     NaN         S
6             6         0       3  ...    9.77     NaN         S
7             7         1       3  ...   31.50     NaN         S
8             8         0       1  ...   73.02   A7253         S
9             9         0       2  ...    9.14   D2969         C
10           10         0       3  ...    8.06     NaN         S
11           11         0       1  ...   31.50   A9055         S
12           12         0       3  ...    9.34   C8674         S
13           13         1       2  ...    7.88     NaN         Q
14           14         1       1  ...   28.40   D6945         C
15           15         1       3  ...    9.31     NaN         S
16           16         0       3  ...    7.92     NaN         S
17           17         0       1  ...   29.84     NaN         S
18           18         0       2  ...    8.85     NaN         S
19           19         1       1  ...  205.01   B7010         Q

[20 rows x 12 columns]

Смотрим на нули

In [30]:
def describe_dataset(dataset):
    print(f'всего {len(dataset.columns)} колонок')
    for i in range (len(dataset.columns)):
        print(f'Информация о колонке {dataset.columns[i]}')
        if len(dataset[dataset.columns[i]].unique()) > 10:
            print(f'В колонке {dataset.columns[i]} более 10 уникальных значений')
            print(f'В колонке {dataset.columns[i]} - {sum(train[train.columns[i]].isna())} нулевых значений')
            print(f'В колонке {dataset.columns[i]} - {sum(train[train.columns[i]].notna())} ненулевых значений')
            print('\n', '*'*35)
        else:
            print(f'В колонке {dataset.columns[i]} следующие уникальные значения: {dataset[dataset.columns[i]].unique()}')
            print(f'В колонке {dataset.columns[i]} - {sum(train[train.columns[i]].isna())} нулевых значений')
            print(f'В колонке {dataset.columns[i]} - {sum(train[train.columns[i]].notna())} ненулевых значений')
            print('\n', '*'*35)
    return

In [31]:
describe_dataset(train)

всего 12 колонок
Информация о колонке PassengerId
В колонке PassengerId более 10 уникальных значений
В колонке PassengerId - 0 нулевых значений
В колонке PassengerId - 100000 ненулевых значений

 ***********************************
Информация о колонке Survived
В колонке Survived следующие уникальные значения: [1 0]
В колонке Survived - 0 нулевых значений
В колонке Survived - 100000 ненулевых значений

 ***********************************
Информация о колонке Pclass
В колонке Pclass следующие уникальные значения: [1 3 2]
В колонке Pclass - 0 нулевых значений
В колонке Pclass - 100000 ненулевых значений

 ***********************************
Информация о колонке Name
В колонке Name более 10 уникальных значений
В колонке Name - 0 нулевых значений
В колонке Name - 100000 ненулевых значений

 ***********************************
Информация о колонке Sex
В колонке Sex следующие уникальные значения: ['male' 'female']
В колонке Sex - 0 нулевых значений
В колонке Sex - 100000 ненулевых значений

 ***********************************
Информация о колонке Age
В колонке Age более 10 уникальных значений
В колонке Age - 3292 нулевых значений
В колонке Age - 96708 ненулевых значений

 ***********************************
Информация о колонке SibSp
В колонке SibSp следующие уникальные значения: [2 0 1 3 4 8 5]
В колонке SibSp - 0 нулевых значений
В колонке SibSp - 100000 ненулевых значений

 ***********************************
Информация о колонке Parch
В колонке Parch следующие уникальные значения: [0 2 1 4 3 5 6 9]
В колонке Parch - 0 нулевых значений
В колонке Parch - 100000 ненулевых значений

 ***********************************
Информация о колонке Ticket
В колонке Ticket более 10 уникальных значений
В колонке Ticket - 4623 нулевых значений
В колонке Ticket - 95377 ненулевых значений

 ***********************************
Информация о колонке Fare
В колонке Fare более 10 уникальных значений
В колонке Fare - 134 нулевых значений
В колонке Fare - 99866 ненулевых значений

 ***********************************
Информация о колонке Cabin
В колонке Cabin более 10 уникальных значений
В колонке Cabin - 67866 нулевых значений
В колонке Cabin - 32134 ненулевых значений

 ***********************************
Информация о колонке Embarked
В колонке Embarked следующие уникальные значения: ['S' 'C' 'Q' nan]
В колонке Embarked - 250 нулевых значений
В колонке Embarked - 99750 ненулевых значений

 ***********************************

Из функции ниже видно, что колонок с нулевыми значениями - 5

Age

Ticket

Fare

Cabin

Embarked

## Работа с колонкой Age

In [33]:
age = train['Age']

In [34]:
age.describe()

count    96708.000000
mean        38.355472
std         18.313556
min          0.080000
25%         25.000000
50%         39.000000
75%         53.000000
max         87.000000
Name: Age, dtype: float64